52n-ses-webapp/src/main/muse-webcontent/WEB-INF/examples/GetCapabilities.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">${ses_host}</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://www.opengis.net/ses/GetCapabilitiesRequest</wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:2ff4a75b-bfbf-8aff-f2eb-315871d23978</wsa:MessageID>
        <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <ses:GetCapabilities service="SES"
            xmlns:ses="http://www.opengis.net/ses/0.0"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.opengis.net/sas/1.0.0 sesCapabilities.xsd"/>
    </soap:Body>
</soap:Envelope>